{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Affiliate License-Licensee",
    "1": "Affiliate License-Licensor",
    "2": "Anti-Assignment",
    "3": "Audit Rights",
    "4": "Cap On Liability",
    "5": "Change Of Control",
    "6": "Competitive Restriction Exception",
    "7": "Covenant Not To Sue",
    "8": "Exclusivity",
    "9": "Insurance",
    "10": "Ip Ownership Assignment",
    "11": "Irrevocable Or Perpetual License",
    "12": "Joint Ip Ownership",
    "13": "License Grant",
    "14": "Liquidated Damages",
    "15": "Minimum Commitment",
    "16": "Most Favored Nation",
    "17": "No-Solicit Of Customers",
    "18": "No-Solicit Of Employees",
    "19": "Non-Compete",
    "20": "Non-Disparagement",
    "21": "Non-Transferable License",
    "22": "Post-Termination Services",
    "23": "Price Restrictions",
    "24": "Revenue/Profit Sharing",
    "25": "Rofr/Rofo/Rofn",
    "26": "Source Code Escrow",
    "27": "Termination For Convenience",
    "28": "Third Party Beneficiary",
    "29": "Uncapped Liability",
    "30": "Unlimited/All-You-Can-Eat-License",
    "31": "Volume Restriction",
    "32": "Warranty Duration"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Affiliate License-Licensee": 0,
    "Affiliate License-Licensor": 1,
    "Anti-Assignment": 2,
    "Audit Rights": 3,
    "Cap On Liability": 4,
    "Change Of Control": 5,
    "Competitive Restriction Exception": 6,
    "Covenant Not To Sue": 7,
    "Exclusivity": 8,
    "Insurance": 9,
    "Ip Ownership Assignment": 10,
    "Irrevocable Or Perpetual License": 11,
    "Joint Ip Ownership": 12,
    "License Grant": 13,
    "Liquidated Damages": 14,
    "Minimum Commitment": 15,
    "Most Favored Nation": 16,
    "No-Solicit Of Customers": 17,
    "No-Solicit Of Employees": 18,
    "Non-Compete": 19,
    "Non-Disparagement": 20,
    "Non-Transferable License": 21,
    "Post-Termination Services": 22,
    "Price Restrictions": 23,
    "Revenue/Profit Sharing": 24,
    "Rofr/Rofo/Rofn": 25,
    "Source Code Escrow": 26,
    "Termination For Convenience": 27,
    "Third Party Beneficiary": 28,
    "Uncapped Liability": 29,
    "Unlimited/All-You-Can-Eat-License": 30,
    "Volume Restriction": 31,
    "Warranty Duration": 32
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
